app/controllers/specials_controller.rb

SELECT "specials".* FROM "specials" ORDER BY "specials"."location_name" ASC
---
    def index
        render json: Special.all.order(location_name: :asc)

SELECT "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: Special.find(params[:id])

INSERT INTO "specials" ("location_name", "location_image", "location_neighborhood", "location_address", "location_url", "start_time", "end_time", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday", "beer", "wine", "cocktails", "food", "hh_special_text", "needs_create_review", "needs_update_review", "needs_delete_review", "created_at", "updated_at", "lat", "lng") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26) RETURNING "id"
---
    def create
        new_special = Special.create!(special_params)

SELECT "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "specials" SET "location_name" = $1, "start_time" = $2, "end_time" = $3, "needs_update_review" = $4, "updated_at" = $5 WHERE "specials"."id" = $6  [["location_name", "Aloy Modern Thai test"], ["start_time", "06:00:00"], ["end_time", "22:30:00"], ["needs_update_review", true], ["updated_at", "2023-03-20 17:08:45.860665"], ["id", 2]]
---
    def update
        special = Special.find(params[:id])
        special.update!(special_params)

SELECT "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "specials" WHERE "specials"."id" = $1  [["id", 9]]
---
    def destroy
        special = Special.find(params[:id])
        special.destroy

SELECT "user_special_reviews".* FROM "user_special_reviews" WHERE "user_special_reviews"."special_id" = $1  [["special_id", 9]]
SELECT "specials".* FROM "specials" WHERE "specials"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT AVG("user_special_reviews"."rating") FROM "user_special_reviews" WHERE "user_special_reviews"."special_id" = $1  [["special_id", 84]]
---
    def average_rating
        render json: Special.find(params[:id]).user_special_reviews.average(:rating).to_i