app/controllers/user_special_reviews_controller.rb

SELECT "user_special_reviews".* FROM "user_special_reviews" WHERE "user_special_reviews"."special_id" = $1  [["special_id", 12]]
---
    def index
        render json: UserSpecialReview.all

INSERT INTO "user_special_reviews" ("rating", "user_id", "special_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 2], ["user_id", 26], ["special_id", 62], ["created_at", "2023-03-22 20:18:16.078010"], ["updated_at", "2023-03-22 20:18:16.078010"]]
---
    def create
        review = UserSpecialReview.create!(review_params)

SELECT "user_special_reviews".* FROM "user_special_reviews" WHERE "user_special_reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_special_reviews" SET "rating" = $1, "updated_at" = $2 WHERE "user_special_reviews"."id" = $3  [["rating", 3], ["updated_at", "2023-03-20 21:23:17.975922"], ["id", 1]]
---
    def update
        review = UserSpecialReview.find(params[:id])
        review.update!(review_params)