app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "a"], ["password_digest", "[FILTERED]"], ["user_type", nil], ["created_at", "2023-03-14 19:12:13.645181"], ["updated_at", "2023-03-14 19:12:13.645181"]]